package com.p3c.name;

/**
 * 阿里巴巴java开发手册
 *
 * <p>《命名规范》
 *
 * <p>1，强制代码中的命名均不能以下画线或者美元符号开始，也不能以下画线或者美元符号结束
 *
 * <p>2，代码中命名严禁使用拼音与英文混合的方式，更不允许直接使用中文的方式
 *
 * <p>3,类名使用UpperCamelCase风格，但DO/BO/DTO/VO/AO/PO等情形例外
 *
 * <p>4,方法名、参数名、成员变量、局部变量都统一使用lowerCamelCase风格，必须遵从驼峰形式。
 *
 * <p>5,常量命名全部大写，单词间以下画线隔开，力求语义表达完整清楚，不要嫌名字长
 *
 * <p>6，抽象类命名使用Abstract或者Base开头；异常类命名使用Exception结尾；测试类命名以它要测试的类名开始，以Test结尾.
 *
 * <p>7,类型与中括号之间无空格相连定义数组。
 *
 * <p>8，POJO类中布尔类型的变量要加is前缀，否则部分框架解析会引起序列化错误。
 *
 * <p>9，包名统一使用小写，点分隔符之间有且仅有一个自然主义的英语单司。包名统一使用单数形式。 但是类名如果有复数含义， 则类名可以使用复数形式。
 *
 * <p>10，杜绝不规范的缩写民，避免词不义。
 *
 * <p>11,为了达到代码自解释的目标，任何自定义编程元素在命名时，使用尽量褐塘鳢中的单词组合来表达其意。
 *
 * <p>12，如果模块、接口、类、方法使用了设计模式，应在命名时体现出具体模式。
 *
 * <p>13，接口类中的方法和属性不要加任何修饰符号（public也不要加)，保持代码的简洁性，并加上有交的Javadoc注释。
 * 尽量不要在接口里定义变量，如果一定要定义变量，必须是与接口方法相关的，并且是整个应用的基础常量。
 *
 */
public class AlibabaClassNamep {}
