package com.p3c.javadoc;

/**
 * 注释规约
 *
 * <p>1,类、类属性、类方法的注释必须使用javado规范，使用\**内容*\,不得使用\\
 *
 * <p>2,所有的抽象方法（包括接口中的方法）必须要用javadoc注释，除了返回值、参数、异常说明 外，还必须指出该方法做什么事情、实现什么功能。
 *
 * <p>3，所有的类都必须添加创建者和创建日期
 *
 * <p>4，方法内部的单行注释，在被注释的语句上方另起一行，使用//注释 方法内容的多行注释 使用、* *\，注意与代码对齐
 *
 * <p>5,所有的枚举类型字段必须要有注释 ，说明每个数据项的用途，
 *
 * <p>6，与其“半”吊子的英文注释，不如用中文注释把问题说清楚，专用名词与关键字保持英文原文即可
 *
 * <p>7，在修改代码的同时，要对注释 进行相应的修改，尤其是参数、返回值、异常、核心逻辑等修改
 *
 * <p>8，谨慎注释掉代码，要在上方详细说明，而不是简单的注释掉，如果无用，则删除
 *
 * <p>9，注释的要求 9.1）准确的反映 设计思想和代码逻辑。 9.2）能够描述业务含义，使其季程序员能够迅速了解代码背后的信息。
 *
 * <p>10，好的命名、代码结构是自解释的，注释力求精简准确、表达到位，避免出现注释的一个极端：过滥的注释，因为代码的逻辑一旦修改，修改注释 是相当大的负担
 *
 * 11，特殊注释标记，请注明标记人与标记时间。
 * 待办事宜：（标记人，标记时间，【预处理时间】)表示需要实现，但目前还未实现
 */
public class AlibabaJavadoc {}
